[  
  {
    "date": "April 30th",
    "day": "Day 30",
    "iso_date": "2025-04-30",
    "month": "April",
    "title": "FujiFilm X-T20 + Canon FD 75mm-200mm f/4.5, ISO 200, f/?, 1/500 s",
    "image": "/static/img/opad/2025-04/30-04-25.JPG",
    "text": "I wanted to mess with the macro function on this after yesterday. It's... Interesting? I found it quite difficult and unintuitive to use, but at the same time I have hardly any experience with proper macro so I'd blame that on me. As hard and kind of bad as this lens is, there's still a cool amount of detail in the flowers. They're so intricate, which I don't usually see, especially due to my visual impairment. I feel maybe giving this lens a lot more light could help, like maybe a flash or something."
  },
  {
    "date": "April 29th",
    "day": "Day 29",
    "iso_date": "2025-04-29",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 100, f/5.6, 1/500 s",
    "image": "/static/img/opad/2025-04/29-04-25.JPG",
    "text": "So the Mavica has a macro focusing mode. I've never properly used it or thought about it before, just either accidentally had it on and ruined photos, or skipped over it. Turns out, it's actually pretty good."
  },
  {
    "date": "April 28th",
    "day": "Day 28",
    "iso_date": "2025-04-28",
    "month": "April",
    "title": "Canon A-1 + Canon FD 50mm f/1.4, FujiFilm Neopan Acros 100 II",
    "image": "/static/img/opad/2025-04/28-04-25.JPG",
    "text": "This is a special one! I went through my first roll attempting to trichrome! I also got same day developement because I was excited (don't expect that to happen often lol). I was using the Tiffen red 25, Tiffen blue 47, and Tiffen green 58."
  },
  {
    "date": "April 27th",
    "day": "Day 27",
    "iso_date": "2025-04-27",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 100, f/3.8, 1/80 s",
    "image": "/static/img/opad/2025-04/27-04-25.JPG",
    "text": "I nearly forgot to do this for today. I've been sleeping a lot cause I'm still exhausted. Uploading yesterdays today probably threw me a bit as well. Anyway, we're nearing the end of the first month, which feels weird. I need to think about what to do with this page in May. I'll think of a way to paginate this or something."
  },
  {
    "date": "April 26th",
    "day": "Day 26",
    "iso_date": "2025-04-26",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 100, f/6.3, 1/500 s",
    "image": "/static/img/opad/2025-04/26-04-25.JPG",
    "text": "So this is the first day where I've uploaded late huh? This photo was taken yesterday morning, I just got home later than expected last night and was exhausted. I will still upload todays photo later on."
  },
  {
    "date": "April 25th",
    "day": "Day 25",
    "iso_date": "2025-04-25",
    "month": "April",
    "title": "FujiFilm X-T20 + Konica Hexanon AR 40mm f/1.8, ISO 200, f/1.8, 1/1000 s",
    "image": "/static/img/opad/2025-04/25-04-25.JPG",
    "text": "I liked how moody the sky looked, and was planning on taking pictures of that. But then I saw these little lights I forgot were in the garden. I'm really not sure if I'm editing these images well or not, and I'm not sure this website even shows the edits well anyway seen as they're compressed."
  },
  {
    "date": "April 24th",
    "day": "Day 24",
    "iso_date": "2025-04-24",
    "month": "April",
    "title": "Polaroid Sun 600, ISO ?, f/?, ? s",
    "image": "/static/img/opad/2025-04/24-04-25.JPG",
    "text": "Our dog being cute. I promise I will upload scans of these when I get our scanner working. I know it kind of defeats the purpose of polaroids, but I want to share these here somehow."
  },
  {
    "date": "April 23rd",
    "day": "Day 23",
    "iso_date": "2025-04-23",
    "month": "April",
    "title": "Polaroid Sun 600, ISO ?, f/?, ? s",
    "image": "/static/img/opad/2025-04/23-04-25.JPG",
    "text": "This is an interesting one! I got hold of some more 600 polaroid film today, and decided to shoot some to make sure my Sun 600 still worked. As you can see, it does! It's been a while since i've used it. I initially wanted to scan this frame, and I will try to again in the coming days, but our scanner isn't working anymore for some reason."
  },
  {
    "date": "April 22nd",
    "day": "Day 22",
    "iso_date": "2025-04-22",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 100, f/8, 1/500 s",
    "image": "/static/img/opad/2025-04/22-04-25.JPG",
    "text": "I really do love the photos from this camera haha. I go on about it every time I bring it out to shoot. I was missing it when I was away on holiday. Other than that, I finally got some scans for a roll of Harman Red I shot a few weeks ago. Maybe I'll write up some stuff about it and share some of the photos, I don't know how much of value I'll have to say though as I don't remember any of the exposure values or anything."
  },
  {
    "date": "April 21st",
    "day": "Day 21",
    "iso_date": "2025-04-21",
    "month": "April",
    "title": "FujiFilm X-T20 + Canon FD 75mm-200mm f/4.5, ISO 200, f/?, 1/250 s",
    "image": "/static/img/opad/2025-04/21-04-25.JPG",
    "text": "This lens is pretty hard to use huh? I don't know I took quite a few pictures with it this afternoon and wow, all of them had this fuzzy discolouration or whatever it is. Anyway I think this is the best of them, I wish I had something better for today but yeah. I'm not feeling good today so I don't really want to go out and try again."
  },
  {
    "date": "April 20th",
    "day": "Day 20",
    "iso_date": "2025-04-20",
    "month": "April",
    "title": "FujiFilm X-T20 + Minolta AF 35-70mm f/4, ISO 200, f/?, 1/500 s",
    "image": "/static/img/opad/2025-04/20-04-25.JPG",
    "text": "So I'm home now, and have decided to dig out an old lens I've never used. The story with this is that when I first got into 35mm photography, I tried to buy my first camera on Ebay. It was a Minolta X-700. It didn't work, and a camera repair shot said it had months of water damage. So I got a full refund and didn't have to return it because the seller refused to co-operate. Then later on my parents got me a Canon A-1, which I sometimes still use."
  },
  {
    "date": "April 19th",
    "day": "Day 19",
    "iso_date": "2025-04-19",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 27mm f/2.8, ISO 200, f/11, 1/250 s",
    "image": "/static/img/opad/2025-04/19-04-25.JPG",
    "text": "Before heading home from our trip we went to feed the various birds at the lake. While we did that I let a duck eat out of my hand, and tried using continuous shutter to get pictures of different movements. This is an example of that. The swans would flap their wings when getting out of the water and that's what I tried to capture here. I'd say it was pretty successful, and was a nice end to our week away. I did edit this slightly, it was the first time I've tried properly. Not sure I did very well with that."
  },
  {
    "date": "April 18th",
    "day": "Day 18",
    "iso_date": "2025-04-18",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 14mm f/2.8, ISO 2500, f/2.8, 30 s",
    "image": "/static/img/opad/2025-04/18-04-25.JPG",
    "text": "This is the last full day I get on my trip away, and what a photo to end it with! This was taken on the beach, and is the most successful I've ever been with astro photography! I've tried it many times before, but always had issues. So this makes me extremely happy! I've also seemingly fixed the dust that was on my camera, it was on the sensor. So that is also very relieving."
  },
  {
    "date": "April 17th",
    "day": "Day 17",
    "iso_date": "2025-04-17",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 14mm f/2.8, ISO 200, f/22, 1/8 s",
    "image": "/static/img/opad/2025-04/17-04-25.JPG",
    "text": "Not a positive day today in terms of digital photography. This morning I got up early to shoot the sunrise, and that's what I had planned to upload today. But not only was it behind clouds, all my digital photos were ruined by dust on my filters/lens. I removed and cleaned the ND filter, then went out to shoot the sunset without it. The dust is still there. I'm worried at this point that the 14mm lens is ruined, or even worse, the sensor is. I'm not feeling good at all and I'm not sure how to go about testing it further."
  },
  {
    "date": "April 16th",
    "day": "Day 16",
    "iso_date": "2025-04-16",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 27mm f/2.8, ISO 200, f/9, 1/1000 s",
    "image": "/static/img/opad/2025-04/16-04-25.JPG",
    "text": "This isn't what I'd intended to upload today. I was doing some long exposures at sunset with my 14mm lens, but there was dust I didn't see on the VND filter so uh, dust in all the shots. Oh well. I think this lantern looks interesting anyway."
  },
  {
    "date": "April 15th",
    "day": "Day 15",
    "iso_date": "2025-04-15",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 27mm f/2.8, ISO 200, f/5.6, 1/2000 s",
    "image": "/static/img/opad/2025-04/15-04-25.JPG",
    "text": "A very cool looking windmill. I kind of wish I had a lens with a longer focal length to get closer to stuff like this and birds, but I didn't bring one unfortunately. I also didn't realize I've been at this for two weeks now. At this point I would like to tidy up this page and make it slightly more functional. Maybe I'll get to that over the next few days."
  },
  {
    "date": "April 14th",
    "day": "Day 14",
    "iso_date": "2025-04-14",
    "month": "April",
    "title": "FujiFilm X-T20 + FujiFilm XF 14mm f/2.8, ISO 400, f/3.2, 1/125 s",
    "image": "/static/img/opad/2025-04/14-04-25.JPG",
    "text": "Was planning on doing a silly surprise camera today, but I liked this view a lot so went with this. It is a lovely lake with lots of swans, ducks, etc."
  },
  {
    "date": "April 13th",
    "day": "Day 13",
    "iso_date": "2025-04-13",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 160, f/3.9, 1/80 s",
    "image": "/static/img/opad/2025-04/13-04-25.JPG",
    "text": "Not much to say about this photo. Plans all fell through today, but regardless I love shooting with this camera. Over the next week I will be away. I will still be taking a photo for this site every day, but I may not be able to upload them until I'm back, we'll see."
  },
  {
    "date": "April 12th",
    "day": "Day 12",
    "iso_date": "2025-04-12",
    "month": "April",
    "title": "Canon Powershot SX540 HS, ISO 100, f/6.3, 1/125 s",
    "image": "/static/img/opad/2025-04/12-04-25.JPG",
    "text": "More IR photography. Not much to say I haven't had the best day. Didn't feel like shooting much of anything at all."
  },
  {
    "date": "April 11th",
    "day": "Day 11",
    "iso_date": "2025-04-11",
    "month": "April",
    "title": "FujiFilm X-T20 + Canon FD 75mm-200mm f/4.5, ISO 200, f/?, 1/250 s",
    "image": "/static/img/opad/2025-04/11-04-25.JPG",
    "text": "One of my least used FD lenses with an adapter. It is kind of awkward to use given its size and weight. I feel i'd want to use a tripod with it but then it'd just tip over. Oh well, it's nice anyway. I got some pretty good photos of my dog and flowers. There's some glowing stuff around some of the petals, they can probably be fixed in editing, but I have got no clue how to edit. I wanted to go for a longer walk today. I had a plan and everything but I just couldn't make myself go so I just sat in the garden and did this."
  },
  {
    "date": "April 10th",
    "day": "Day 10",
    "iso_date": "2025-04-10",
    "month": "April",
    "title": "FujiFilm X-T20 + Disposable camera lens, ISO 200, f/?, 1/500 s",
    "image": "/static/img/opad/2025-04/10-04-25.JPG",
    "text": "This is the disposable lens I mentioned yesterday. It obviously isn't perfect. The distance from the lens to the sensor isn't right but this is the best I could get for now. Maybe I'll try again in the future. This is originally from a FujiFilm disposable, I don't remember the aperture or focal length (probably 35mm)."
  },
  {
    "date": "April 9th",
    "day": "Day 9",
    "iso_date": "2025-04-09",
    "month": "April",
    "title": "FujiFilm X-T20 + Viltrox 56mm f/1.7, ISO 200, f/1.7, 1/500 s",
    "image": "/static/img/opad/2025-04/09-04-25.JPG",
    "text": "I was experimenting with the film simulation options on my X-T20, as I've usually just set it to Classic Chrome and left it. This is the standard Acros simulation. I quite like the results. Something I would like to have examples of here in the coming days is a disposable camera lens I've \"adapted\" to an X-mount body cap. But I've got to tweak it a bit first."
  },
  {
    "date": "April 8th",
    "day": "Day 8",
    "iso_date": "2025-04-08",
    "month": "April",
    "title": "Canon Powershot SX540 HS, ISO 200, f/5, 1/400 s",
    "image": "/static/img/opad/2025-04/08-04-25.JPG",
    "text": "This is an interesting one! At least I think it is. It was taken by setting the IR pass filter to 750nm, letting (mostly) only IR through. I then used a black and white preset later to make it, well, black and white. I like the result I got here, and will definitely be exploring this more in the future. I also feel the photos I got with this camera today are better than the previous ones, so maybe I'm getting a feel for the funky focusing the modification has caused."
  },
  {
    "date": "April 7th",
    "day": "Day 7",
    "iso_date": "2025-04-07",
    "month": "April",
    "title": "FujiFilm X-T20 + Konica Hexanon AR 40mm f/1.8, ISO 200, f/1.8, 1/60 s",
    "image": "/static/img/opad/2025-04/07-04-25.JPG",
    "text": "Manual focusing practice. I'm visually impaired, so it can be the hardest part of photography for me. It's harder on digital as well, probably something to do with displays but I don't know. This photo isn't great, maybe because of the slow shutter speed or the fact that I forgot to change the lens adapter setting, I don't know. I do like this adapted lens a lot though, it can get some amazing Bokeh for portraits and has a nice feel to it. Side note: I definitely need to work something out for compression or something on this page."
  },
  {
    "date": "April 6th",
    "day": "Day 6",
    "iso_date": "2025-04-06",
    "month": "April",
    "title": "Canon Powershot SX540 HS, ISO 400, f/3.5, 1/800 s",
    "image": "/static/img/opad/2025-04/06-04-25.JPG",
    "text": "Not particularly happy with this one, it's a badly edited photo with the IR filter again. I haven't been out today so couldn't think of much. I'll try and be more creative tomorrow."
  },
  {
    "date": "April 5th",
    "day": "Day 5",
    "iso_date": "2025-04-05",
    "month": "April",
    "title": "Canon Powershot SX540 HS, ISO 100, f/3.4, 1/1000 s",
    "image": "/static/img/opad/2025-04/05-04-25.JPG",
    "text": "I got a variable IR filter for the converted Powershot! I think this looks amazing, especially when set to lower values which lets more of the higher wavelenght visible light in. It looks alien. It does unfortunately struggle with focusing the farther away the subject is. I have a feeling this is because I didn't replace the hot mirror with any glass, but I couldn't do that at the time. I still love it though."
  },
  {
    "date": "April 4th",
    "day": "Day 4",
    "iso_date": "2025-04-04",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 100, f/3.8, 1/250 s",
    "image": "/static/img/opad/2025-04/04-04-25.JPG",
    "text": "I've been really enjoying using the Mavica recently, so I have a feeling there will be a lot of it for a while."
  },
  {
    "date": "April 3rd",
    "day": "Day 3",
    "iso_date": "2025-04-03",
    "month": "April",
    "title": "FujiFilm X-T20 + XF 27mm f/2.8, ISO 200, f/8, 1/250 s",
    "image": "/static/img/opad/2025-04/03-04-25.JPG",
    "text": "This is a photo of a test event for an old District Line train converted to use a fast- charging battery. I didn't take many photos of it unfortunately, I focused more on testing a camcorder that I was given recently."
  },
  {
    "date": "April 2nd",
    "day": "Day 2",
    "iso_date": "2025-04-02",
    "month": "April",
    "title": "Canon Powershot SX540 HS, ISO 100, f/8, 1/500 s",
    "image": "/static/img/opad/2025-04/02-04-25.JPG",
    "text": "I have a bit more to say about this one. It’s clear that the colours are quite strange here. This is because I actually modified (or mutilated) the camera. I may do a writeup of this in case anyone else ever wants to do it with a similar camera, but in short I opened it up following a guide for a similar model, then removed the hot mirror filter from the sensor. I didn’t have glass to replace the hot mirror with, so it isn’t perfect. Plus I guarantee I didn’t do a great job overall. But regardless, it is an interesting full-spectrum camera to experiment with. I plan to do more with it in the future, including things like IR pass filters. I will try and do something a bit more conventional tomorrow."
  },
  {
    "date": "April 1st",
    "day": "Day 1",
    "iso_date": "2025-04-01",
    "month": "April",
    "title": "Sony Mavica MVC-FD200, ISO 320, f/3.8, 1/30 s",
    "image": "/static/img/opad/2025-04/01-04-25.JPG",
    "text": "This is a camera I like a lot. It has a built-in floppy drive, which can be used to store photos on floppy disks. I was using the memory card today though for no real reason. The quality is surprisingly good on the photos it takes, obviously this isn’t the best example though. The reason I picked this photo is that I just like how this part of the Central Line looks. The style of the stations just looks really nice to me."
  }
]